# SQL

A database language

- Database: we store data in table

## DB Management Systems

- MySQL --> separatable
- PostgreSQL --> separatable
- SQLite --> store in a file
- ...

### SQLite Types

```
TEXT                string
NUMERIC             number-like, e.g., boolean, date
INTEGER             integer (signed)
REAL                floating-point
BLOB                Binary Large OBject, pure binary, e.g., files, images
```

### MySQL Types

```
CHAR(size)          fixed-length char
VARCHAR(size)       length up to size, variable-length char
SMALLINT            like short int
INT                 like int
BIGINT              like long
FLOAT               like float
DOUBLE              like double
...
```

## Creating a Table

```sql
CREATE TABLE <table_name> (
    <column_name> <TYPE> PRIMARY KEY <cue>,
    <column_name> <TYPE> [additional constraint],
    <column_name> <TYPE> [additional constraint],
    <column_name> <TYPE> [additional constraint]
);
```

> ### Flights
> 
> | origin    | destination   | duration  |
> | :----:    | :---------:   | :------:  |
> | New York  | London        | 415       |
> | Shanghai  | Paris         | 760       |
> | Istanbul  | Tokyo         | 700       |
> | New York  | Paris         | 435       |
> | Moscow    | Paris         | 245       |
> | Lima      | New York      | 455       |
> 
> ```sql
> CREATE TABLE flights (
>     id INTEGER PRIMARY KEY AUTOINCREMENT,
>     origin TEXT NOT NULL,
>     destination TEXT NOT NULL,
>     duration INTEGER NOT NULL
> );
> ```

### Constraints

```
CHECK               Check if a value obeys a certain condition, e.g., if a number falls within a certain range
DEFAULT             Assigns default value
NOT NULL            Not NULL
PRIMARY KEY         The PRIMARY KEY
UNIQUE              No duplicates in the same column
...
```

## Inserting Data

```sql
INSERT
```

> ## Flights
> 
> ```sql
> INSERT INTO flights
>     (origin, destination, duration)
>     VALUES ("New York", "London", 415);
> ```
> 
> Takes the `flights` table then insert some values.

## Retrieving Data

```
SELECT
```

> ### Flights
> 
> #### Columns
> 
> ```sql
> SELECT * FROM flights;
> ```
> 
> Selects all (`*`) the data in `flights`
> 
> | id      | origin    | destination   | duration  |
> | :---:   | :----:    | :---------:   | :------:  |
> | 1       | New York  | London        | 415       |
> | 2       | Shanghai  | Paris         | 760       |
> | 3       | Istanbul  | Tokyo         | 700       |
> | 4       | New York  | Paris         | 435       |
> | 5       | Moscow    | Paris         | 245       |
> | 6       | Lima      | New York      | 455       |
> 
> - - -
> 
> ```sql
> SELECT origin, destination FROM flights;
> ```
> 
> Selects only `origin` and `destination` columns in `flights`
> 
> |         | origin    | destination   |           |
> | :---:   | :----:    | :---------:   | :------:  |
> |         | New York  | London        |           |
> |         | Shanghai  | Paris         |           |
> |         | Istanbul  | Tokyo         |           |
> |         | New York  | Paris         |           |
> |         | Moscow    | Paris         |           |
> |         | Lima      | New York      |           |
> 
> -----
> 
> #### Rows
> 
> ```sql
> SELECT * FROM flights WHERE id = 3;
> ```
> 
> | id      | origin    | destination   | duration  |
> | :---:   | :----:    | :---------:   | :------:  |
> |         |           |               |           |
> |         |           |               |           |
> | 3       | Istanbul  | Tokyo         | 700       |
> |         |           |               |           |
> |         |           |               |           |
> |         |           |               |           |
> 
> - - -
> 
> ```sql
> SELECT * FROM flights WHERE origin = "New York";
> ```
> 
> | id      | origin    | destination   | duration  |
> | :---:   | :----:    | :---------:   | :------:  |
> | 1       | New York  | London        | 415       |
> |         |           |               |           |
> |         |           |               |           |
> | 4       | New York  | Paris         | 435       |
> |         |           |               |           |
> |         |           |               |           |

In [ ]:
CREATE TABLE flights (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    origin TEXT NOT NULL,
    destination TEXT NOT NULL,
    duration INTEGER NOT NULL
);

In [ ]:
INSERT INTO flights (origin, destination, duration) VALUES ("New York", "London", 415);
INSERT INTO flights (origin, destination, duration) VALUES ("Shanghai", "Paris", 760);
INSERT INTO flights (origin, destination, duration) VALUES ("Istanbul", "Tokyo", 700);
INSERT INTO flights (origin, destination, duration) VALUES ("New York", "Paris", 435);
INSERT INTO flights (origin, destination, duration) VALUES ("Moscow", "Paris", 245);
INSERT INTO flights (origin, destination, duration) VALUES ("Lima", "New York", 455);

In [ ]:
.tables

.mode columns
.headers yes

### Boolean

In [ ]:
SELECT * FROM flights WHERE duration > 500;

SELECT * FROM flights WHERE duration > 500
        AND destination = "Paris";

SELECT * FROM flights WHERE duration > 500
        OR destination = "Paris";

SELECT * FROM flights WHERE origin IN ("New York", "Lima");

### Patterns

In [ ]:
SELECT * FROM flights WHERE origin LIKE "%a%";

### Functions

```
AVERAGE
COUNT
MAX
MIN
SUM
...
```

## Updating Data

```
UPDATE
```

> ### Flights
> 
> ```sql
> UPDATE flights
>     SET duration = 430
>     WHERE origin = "New York"
>     AND destination = "London";
> ```

## Deleting Data

```
DELETE
```

> ### Flights
> 
> ```sql
> DELETE FROM flights WHERE destination = "Tokyo";
> ```

## Other Clauses

```
LIMIT
ORDER BY
GROUP BY
HAVING
...
```